---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.EllipseXParam
source: html/1c7357d8-f830-f59e-f766-b06238dd4a9f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.EllipseXParam Property

"X-Radius Value for Ellipse (for Use with XAML Data Template example)"

## Syntax (C#)
```csharp
public static ForgeTypeId EllipseXParam { get; }
```